Revit 2027 API
BuiltInFailures.RebarFailures.HostTopologyChange Property
 A reinforced host has undergone a major change. The reinforcement must be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostTopologyChange { get; }
Public Shared ReadOnly Property HostTopologyChange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostTopologyChange {
	FailureDefinitionId^ get ();
}
static member HostTopologyChange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace